damBreak_highres/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<vector> 
1020
(
(0.009125 0.009125 0.0073)
(0.027375 0.009125 0.0073)
(0.045625 0.009125 0.0073)
(0.063875 0.009125 0.0073)
(0.082125 0.009125 0.0073)
(0.100375 0.009125 0.0073)
(0.118625 0.009125 0.0073)
(0.136875 0.009125 0.0073)
...
)
;

boundaryField
{
    leftWall
    {
        type            calculated;
        value           nonuniform List<vector> 
32
(
(0 0.009125 0.0073)
(0 0.027375 0.0073)
(0 0.045625 0.0073)
(0 0.063875 0.0073)
(0 0.082125 0.0073)
(0 0.100375 0.0073)
(0 0.118625 0.0073)
(0 0.136875 0.0073)
...
)
;
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<vector> 
32
(
(0.584 0.009125 0.0073)
(0.584 0.027375 0.0073)
(0.584 0.045625 0.0073)
(0.584 0.063875 0.0073)
(0.584 0.082125 0.0073)
(0.584 0.100375 0.0073)
(0.584 0.118625 0.0073)
(0.584 0.136875 0.0073)
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<vector> 
36
(
(0.009125 0 0.0073)
(0.027375 0 0.0073)
(0.045625 0 0.0073)
(0.063875 0 0.0073)
(0.082125 0 0.0073)
(0.100375 0 0.0073)
(0.118625 0 0.0073)
(0.136875 0 0.0073)
...
)
;
    }
    atmosphere
    {
        type            calculated;
        value           nonuniform List<vector> 
32
(
(0.009125 0.584 0.0073)
(0.027375 0.584 0.0073)
(0.045625 0.584 0.0073)
(0.063875 0.584 0.0073)
(0.082125 0.584 0.0073)
(0.100375 0.584 0.0073)
(0.118625 0.584 0.0073)
(0.136875 0.584 0.0073)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
